VocabPictures/app/controllers/api/v1/images_controller.rb

INSERT INTO "images" ("category", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category", "test"], ["url", "new"], ["created_at", "2021-06-02 02:15:06.730812"], ["updated_at", "2021-06-02 02:15:06.730812"]]
---
    def create
      @image = Image.new(image_params)

      if @image.save

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
    def destroy
      if @image.destroy